app/controllers/login_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE (email = matheus.smacedo@hotmail.com)
SELECT "usuarios".* FROM "usuarios" WHERE (email = NULL and senha = NULL)
---
    def create
        user = Usuario.new login_params
        usuario = Usuario.where("email = ? and senha = ?",user.email,user.senha)
        if !usuario.blank?